papers/privacy/presentations/L02_gamesNE/Nash_eq_solver2.org
#+TITLE:    Finding mixed Nash equilibria in finite strategic games of complete information
#+AUTHOR:    Christoph
#+EMAIL:    
#+DATE:      2015-07-31 Fri
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+HTML_HEAD: <script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"> </script>

* Using a numerical approach based on solving an equation system

In a mixed equilibrium, each player uses only best responses with positive probability.  Denote the mixed strategy of player $i$ by the vector $x_i$ (which contains for each action the probability with which it is played). Denoting the expected utility for player $i$ when playing a best response as $EU_i^{br}$ (this will of course depend on $x_{-i}$ which we omit for brevity), we can write the vector 
$$\Delta_i(x_{-i})=(EU_i(a_1)-EU_i^{br},EU_i(a_2)-EU_i^{br}\dots EU_i(a_n)-EU_i^{br})$$ 
as the vector containing for each action of player $i$ the difference of the expected utility when taking this action and when taking the best response. Clearly, at least one entry in this vector is zero (each entry corresponding to a best response) and all other entries are negative. Therefore, we can describe an equilibrium by the following equations
$$\Delta_i(x_{-i})x_i=0\qquad \text{for all players } i$$
together with the feasibility constraints 
$$\mathbf{0}\leq x_i\leq \mathbf{1}\qquad \text{ and }\qquad x_i\mathbf{1}=1.$$
This is a simple system of equations with constraints and we can use a standard solver to get a solution, i.e. an equilibrium.

We use the example game:

#+CAPTION: Example
#+ATTR_HTML: :border 2 :rules all :frame border :align center
|   | L   | R   |
|---+-----+-----|
| U | 0,0 | 3,1 |
| D | 1,3 | 1,1 |

