papers/privacy/presentations/L02_gamesNE/Nash_eq_solver2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-16 Di 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Finding mixed Nash equilibria in finite strategic games of complete information</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christoph" />
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">

    <p style="text-align: justify;">
      
  <a id="subtitle" href="https://schottmueller.github.io/index.html">Home</a>
  <a id="subtitle" href="https://schottmueller.github.io/research.html">Research</a>
  <a id="subtitle" href="https://schottmueller.github.io/teaching.html">Teaching</a>
  <a id="subtitle" href="https://schottmueller.github.io/misc.html">Misc</a>

  <span> </span>
</div>

</p>

</div>
</div>
</div>
<div id="content">
<h1 class="title">Finding mixed Nash equilibria in finite strategic games of complete information</h1>

<div id="outline-container-orgc12c13f" class="outline-2">
<h2 id="orgc12c13f"><span class="section-number-2">1</span> Using a numerical approach based on solving an equation system</h2>
<div class="outline-text-2" id="text-1">
<p>
In a mixed equilibrium, each player uses only best responses with positive probability.  Denote the mixed strategy of player \(i\) by the vector \(x_i\) (which contains for each action the probability with which it is played). Denoting the expected utility for player \(i\) when playing a best response as \(EU_i^{br}\) (this will of course depend on \(x_{-i}\) which we omit for brevity), we can write the vector 
\[\Delta_i(x_{-i})=(EU_i(a_1)-EU_i^{br},EU_i(a_2)-EU_i^{br}\dots EU_i(a_n)-EU_i^{br})\] 
as the vector containing for each action of player \(i\) the difference of the expected utility when taking this action and when taking the best response. Clearly, at least one entry in this vector is zero (each entry corresponding to a best response) and all other entries are negative. Therefore, we can describe an equilibrium by the following equations
\[\Delta_i(x_{-i})x_i=0\qquad \text{for all players } i\]
together with the feasibility constraints 
\[\mathbf{0}\leq x_i\leq \mathbf{1}\qquad \text{ and }\qquad x_i\mathbf{1}=1.\]
This is a simple system of equations with constraints and we can use a standard solver to get a solution, i.e. an equilibrium.
</p>

<p>
We use the example game:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" align="center">
<caption class="t-above"><span class="table-number">Table 1:</span> Example</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">L</th>
<th scope="col" class="org-left">R</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">U</td>
<td class="org-left">0,0</td>
<td class="org-left">3,1</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">1,3</td>
<td class="org-left">1,1</td>
</tr>
</tbody>
</table>
</div>
