papers/privacy/presentations/L02_gamesNE/Nash_eq_solver2.org
** 2 player games

First, we have a program for 2 player games (which is slightly easier to read). Below we will then have a second program for n-player games.

#+BEGIN_SRC python :exports both :results output
  from openopt import SNLE
  from numpy import dot
  import time
  start_time = time.time()
  
  #these are the payoffs from the game table; 
  #each row in the game table is a list of payoff tuples; 
  #the game table is then a list of these rows
  payoffs = [[(0,0),(3,1)],[(1,3),(1,1)]]

  n = len(payoffs)#this is the number of actions of P1
  m = len(payoffs[0])#this is the number of actions of P2
  #next we extract the payoffs of only player 1 from the payoffs above
  payoff1 = []
  for i in payoffs:
      temp = []
      for j in i:
          temp.append(j[0])
      payoff1.append(temp)

  #now we extract the payoffs for P2
  payoff2 = []
  for i in payoffs:
      temp = []
      for j in i:
          temp.append(j[1])
      payoff2.append(temp)

  #expected utility of P1 when using action a1 while P2 uses the mixed strategy strat2
  def EU1(a1,strat2):
      return dot(payoff1[a1],strat2)#dot gives the vector "dot-product" of two arrays
  #expected utility of P2 when using action a2 while P1 uses the mixed strategy strat1
  def EU2(a2,strat1):
      temp = 0
      i = 0
      while i<n:
          temp = temp + payoff2[i][a2]*strat1[i]
          i += 1
      return temp

  #This function takes a vecor x which contains both a mixed strategy of P1 (in the first n elements) 
  #and also a mixed strategy of P2 (in the following m elements). 
  #The output of the function is the Delta described above but again it returns the Delta for both players.
  def Delta(x):
      x1 = x[:n]#P1's mixed strategy
      x2 = x[n:]#P2's mixed strategy
      EU1max = 0.0#will containt the best response EU of P1
      EU1list = []#will become Delta_1(x2)
      i = 0
      while i<n:#loop through all actions of P1
          temp = EU1(i,x2)
          EU1max = max(temp,EU1max)
          EU1list.append(temp)
          i+=1
      EU1list = [z - EU1max for z in EU1list]#now EU1list is the Delta_1(x2) described above
      i = 0
      EU2list = []
      EU2max = 0.0
      while i<m:
          temp = EU2(i,x1)
          EU2max = max(temp,EU2max)
          EU2list.append(temp)
          i+=1
      EU2list = [y - EU2max for y in EU2list]
      EUlist = EU1list + EU2list
      return EUlist

  #multiplies the vectors x and Delta(x); this product has to be 0 in equilibrium
  def product(x):
      return dot(x,Delta(x))

  lb = [0.0]*(n+m)#lower bound to ensure that all probabilities are above 0
  ub = [1.0]*(n+m)#upper bound ensures that all probs are below 1
  Aeq = [[1.0]*n+[0.0]*m,[0.0]*n+[1.0]*m]#constraints that ensure that both the  mixed strategy of P1 and P2 sum to 1
  beq = [1.0,1.0]
  x0 = [1.0/n]*n+[1.0/m]*m#arbitrary starting value for the algorithm 

  p = SNLE(product,x0,lb=lb,ub=ub,Aeq=Aeq,beq=beq)
  p.iprint = -1
  r = p.solve('nssolve')

  if r.stopcase==1:
      print 'equilibrium: P1 plays',r.xf[:n],' and P2 plays',r.xf[n:]
  else:
      print 'Error: solver cannot find an equilibrium'

  print("--- %s seconds ---" % (time.time() - start_time))
#+END_SRC

Note that the program above will give you only one equilibrium and not all equilibria. In principle, this could be changed by either trying many different starting values or by using a "global" equation solver that can find all solutions. 

