papers/privacy/presentations/L02_gamesNE/Nash_eq_solver2.html

<div id="outline-container-org71865cb" class="outline-3">
<h3 id="org71865cb"><span class="section-number-3">1.1</span> 2 player games</h3>
<div class="outline-text-3" id="text-1-1">
<p>
First, we have a program for 2 player games (which is slightly easier to read). Below we will then have a second program for n-player games.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">from</span> openopt <span style="color: #859900; font-weight: bold;">import</span> SNLE
<span style="color: #859900; font-weight: bold;">from</span> numpy <span style="color: #859900; font-weight: bold;">import</span> dot
<span style="color: #859900; font-weight: bold;">import</span> time
<span style="color: #268bd2;">start_time</span> = time.time()

<span style="color: #586e75;">#</span><span style="color: #586e75;">these are the payoffs from the game table; </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">each row in the game table is a list of payoff tuples; </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">the game table is then a list of these rows</span>
<span style="color: #268bd2;">payoffs</span> = [[(0,0),(3,1)],[(1,3),(1,1)]]

<span style="color: #268bd2;">n</span> = <span style="color: #839496; font-weight: bold;">len</span>(payoffs)<span style="color: #586e75;">#</span><span style="color: #586e75;">this is the number of actions of P1</span>
<span style="color: #268bd2;">m</span> = <span style="color: #839496; font-weight: bold;">len</span>(payoffs[0])<span style="color: #586e75;">#</span><span style="color: #586e75;">this is the number of actions of P2</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">next we extract the payoffs of only player 1 from the payoffs above</span>
<span style="color: #268bd2;">payoff1</span> = []
<span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> payoffs:
    <span style="color: #268bd2;">temp</span> = []
    <span style="color: #859900; font-weight: bold;">for</span> j <span style="color: #859900; font-weight: bold;">in</span> i:
        temp.append(j[0])
    payoff1.append(temp)

<span style="color: #586e75;">#</span><span style="color: #586e75;">now we extract the payoffs for P2</span>
<span style="color: #268bd2;">payoff2</span> = []
<span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> payoffs:
    <span style="color: #268bd2;">temp</span> = []
    <span style="color: #859900; font-weight: bold;">for</span> j <span style="color: #859900; font-weight: bold;">in</span> i:
        temp.append(j[1])
    payoff2.append(temp)

<span style="color: #586e75;">#</span><span style="color: #586e75;">expected utility of P1 when using action a1 while P2 uses the mixed strategy strat2</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">EU1</span>(a1,strat2):
    <span style="color: #859900; font-weight: bold;">return</span> dot(payoff1[a1],strat2)<span style="color: #586e75;">#</span><span style="color: #586e75;">dot gives the vector "dot-product" of two arrays</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">expected utility of P2 when using action a2 while P1 uses the mixed strategy strat1</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">EU2</span>(a2,strat1):
    <span style="color: #268bd2;">temp</span> = 0
    <span style="color: #268bd2;">i</span> = 0
    <span style="color: #859900; font-weight: bold;">while</span> i&lt;n:
        <span style="color: #268bd2;">temp</span> = temp + payoff2[i][a2]*strat1[i]
        <span style="color: #268bd2;">i</span> += 1
    <span style="color: #859900; font-weight: bold;">return</span> temp

<span style="color: #586e75;">#</span><span style="color: #586e75;">This function takes a vecor x which contains both a mixed strategy of P1 (in the first n elements) </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">and also a mixed strategy of P2 (in the following m elements). </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">The output of the function is the Delta described above but again it returns the Delta for both players.</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">Delta</span>(x):
    <span style="color: #268bd2;">x1</span> = x[:n]<span style="color: #586e75;">#</span><span style="color: #586e75;">P1's mixed strategy</span>
    <span style="color: #268bd2;">x2</span> = x[n:]<span style="color: #586e75;">#</span><span style="color: #586e75;">P2's mixed strategy</span>
    <span style="color: #268bd2;">EU1max</span> = 0.0<span style="color: #586e75;">#</span><span style="color: #586e75;">will containt the best response EU of P1</span>
    <span style="color: #268bd2;">EU1list</span> = []<span style="color: #586e75;">#</span><span style="color: #586e75;">will become Delta_1(x2)</span>
    <span style="color: #268bd2;">i</span> = 0
    <span style="color: #859900; font-weight: bold;">while</span> i&lt;n:<span style="color: #586e75;">#</span><span style="color: #586e75;">loop through all actions of P1</span>
        <span style="color: #268bd2;">temp</span> = EU1(i,x2)
        <span style="color: #268bd2;">EU1max</span> = <span style="color: #839496; font-weight: bold;">max</span>(temp,EU1max)
        EU1list.append(temp)
        <span style="color: #268bd2;">i</span>+=1
    <span style="color: #268bd2;">EU1list</span> = [z - EU1max <span style="color: #859900; font-weight: bold;">for</span> z <span style="color: #859900; font-weight: bold;">in</span> EU1list]<span style="color: #586e75;">#</span><span style="color: #586e75;">now EU1list is the Delta_1(x2) described above</span>
    <span style="color: #268bd2;">i</span> = 0
    <span style="color: #268bd2;">EU2list</span> = []
    <span style="color: #268bd2;">EU2max</span> = 0.0
    <span style="color: #859900; font-weight: bold;">while</span> i&lt;m:
        <span style="color: #268bd2;">temp</span> = EU2(i,x1)
        <span style="color: #268bd2;">EU2max</span> = <span style="color: #839496; font-weight: bold;">max</span>(temp,EU2max)
        EU2list.append(temp)
        <span style="color: #268bd2;">i</span>+=1
    <span style="color: #268bd2;">EU2list</span> = [y - EU2max <span style="color: #859900; font-weight: bold;">for</span> y <span style="color: #859900; font-weight: bold;">in</span> EU2list]
    <span style="color: #268bd2;">EUlist</span> = EU1list + EU2list
    <span style="color: #859900; font-weight: bold;">return</span> EUlist

<span style="color: #586e75;">#</span><span style="color: #586e75;">multiplies the vectors x and Delta(x); this product has to be 0 in equilibrium</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">product</span>(x):
    <span style="color: #859900; font-weight: bold;">return</span> dot(x,Delta(x))

<span style="color: #268bd2;">lb</span> = [0.0]*(n+m)<span style="color: #586e75;">#</span><span style="color: #586e75;">lower bound to ensure that all probabilities are above 0</span>
<span style="color: #268bd2;">ub</span> = [1.0]*(n+m)<span style="color: #586e75;">#</span><span style="color: #586e75;">upper bound ensures that all probs are below 1</span>
<span style="color: #268bd2;">Aeq</span> = [[1.0]*n+[0.0]*m,[0.0]*n+[1.0]*m]<span style="color: #586e75;">#</span><span style="color: #586e75;">constraints that ensure that both the  mixed strategy of P1 and P2 sum to 1</span>
<span style="color: #268bd2;">beq</span> = [1.0,1.0]
<span style="color: #268bd2;">x0</span> = [1.0/n]*n+[1.0/m]*m<span style="color: #586e75;">#</span><span style="color: #586e75;">arbitrary starting value for the algorithm </span>

<span style="color: #268bd2;">p</span> = SNLE(product,x0,lb=lb,ub=ub,Aeq=Aeq,beq=beq)
<span style="color: #268bd2;">p.iprint</span> = -1
<span style="color: #268bd2;">r</span> = p.solve(<span style="color: #2aa198;">'nssolve'</span>)

<span style="color: #859900; font-weight: bold;">if</span> r.stopcase==1:
    <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">'equilibrium: P1 plays'</span>,r.xf[:n],<span style="color: #2aa198;">' and P2 plays'</span>,r.xf[n:]
<span style="color: #859900; font-weight: bold;">else</span>:
    <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">'Error: solver cannot find an equilibrium'</span>

<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"--- %s seconds ---"</span> % (time.time() - start_time))
</pre>
</div>

<p>
Note that the program above will give you only one equilibrium and not all equilibria. In principle, this could be changed by either trying many different starting values or by using a "global" equation solver that can find all solutions. 
</p>
</div>
</div>
