papers/privacy/presentations/L02_gamesNE/Nash_eq_solver2.html

<div id="outline-container-orgc0942a1" class="outline-3">
<h3 id="orgc0942a1"><span class="section-number-3">1.2</span> n player games</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Note that we use a slightly different notation for the payoff matrix in this setup which allows us to stay organized with more than 2 players.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa198;">""" Finds a Nash equilibrium of a finite strategic form game of complete information.</span>
<span style="color: #2aa198;">A strategy of player i is represented as an array where the number of elements equals</span>
<span style="color: #2aa198;">the number of actions of this player; each element is the probability</span>
<span style="color: #2aa198;">of the corresponding action. </span>
<span style="color: #2aa198;">A strategy profile is an array of strategies. """</span>

<span style="color: #859900; font-weight: bold;">from</span> openopt <span style="color: #859900; font-weight: bold;">import</span> SNLE
<span style="color: #859900; font-weight: bold;">import</span> numpy <span style="color: #859900; font-weight: bold;">as</span> np
<span style="color: #859900; font-weight: bold;">import</span> time
<span style="color: #268bd2;">start_time</span> = time.time()

<span style="color: #586e75;">#</span><span style="color: #586e75;">these are the payoffs from the game table; </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">each column in the game table is a list of payoff tuples; </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">the game table is then a list of these columns</span>
<span style="color: #268bd2;">payoffs</span> = np.array([[[0,0],[1,3]],[[3,1],[1,1]]])
<span style="color: #586e75;">#</span><span style="color: #586e75;">for games with 3 or more players:</span>
<span style="color: #586e75;">## </span><span style="color: #586e75;">3 players: an array with two player games as its components,</span>
<span style="color: #586e75;">##</span><span style="color: #586e75;">the first one corresponds to the first action of P3 etc.</span>
<span style="color: #586e75;">## </span><span style="color: #586e75;">n players: an array of 'n-1 player games', the k-th corresponds to the k-th action of player n</span>
<span style="color: #586e75;">##</span><span style="color: #586e75;">example for 3 players with P1 having 3 actions, P2 and P3 having 2 actions</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">payoffs = np.array([[[[0,0,0],[1,3,0],[1,1,1]],[[3,1,0],[1,1,0],[1,1,1]]],[[[0,0,0],[1,3,0],[1,1,1]],[[3,1,0],[1,1,0],[1,1,1]]]] ) </span>

<span style="color: #268bd2;">dim</span> = payoffs.shape

<span style="color: #268bd2;">n</span> = payoffs.ndim-1<span style="color: #586e75;">#</span><span style="color: #586e75;">number of players</span>
<span style="color: #268bd2;">no_a</span> = [] <span style="color: #586e75;">#</span><span style="color: #586e75;">will contain number of actions available for each player</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">as the first number is number of actions of last player etc., we eventually turn the list around</span>
<span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> dim[:-1]:
    no_a.append(i)
<span style="color: #268bd2;">no_a</span> = no_a[::-1]

<span style="color: #586e75;">#</span><span style="color: #586e75;">gets numpy array of likelihoods of action profiles (from players 0..i-1) and strategy of player i, </span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">returns likelihoods of action profiles for players up to i</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">help</span>(probmatrix, strati):
    <span style="color: #268bd2;">new</span> = np.array([probmatrix*prob <span style="color: #859900; font-weight: bold;">for</span> prob <span style="color: #859900; font-weight: bold;">in</span> strati])
    <span style="color: #859900; font-weight: bold;">return</span> new

<span style="color: #586e75;">#</span><span style="color: #586e75;">returns the expected payoff of player i from playing ai if others play mixed strategies stratmini</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">EUi</span>(stratmini,ai,i):
    <span style="color: #268bd2;">j</span> = n-1<span style="color: #586e75;">#</span><span style="color: #586e75;">the next few lines define a list of slice object to extract i's payoffs when he plays ai from the payoff matrix; </span>
    <span style="color: #586e75;">#</span><span style="color: #586e75;">recall that the first index denotes the action of the last player in payoffs!</span>
    <span style="color: #268bd2;">obj</span> = ()
    <span style="color: #859900; font-weight: bold;">while</span> j&gt;i:
        <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #839496; font-weight: bold;">slice</span>(0,<span style="color: #268bd2; font-weight: bold;">None</span>,1),)
        <span style="color: #268bd2;">j</span> = j-1
    <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #839496; font-weight: bold;">slice</span>(ai,ai+1,1),)
    <span style="color: #268bd2;">j</span> = j-1
    <span style="color: #859900; font-weight: bold;">while</span> j&gt;=0:
        <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #839496; font-weight: bold;">slice</span>(0,<span style="color: #268bd2; font-weight: bold;">None</span> ,1),)
        <span style="color: #268bd2;">j</span> = j-1
    <span style="color: #268bd2;">obj</span> = obj + (<span style="color: #839496; font-weight: bold;">slice</span>(i,i+1,1),)
    <span style="color: #268bd2;">payoffi</span> = payoffs[obj]
    <span style="color: #268bd2;">temp</span> = np.array([1.])<span style="color: #586e75;">#</span><span style="color: #586e75;">constructs probability matrix, giving probabilities of action profiles of other players</span>
    <span style="color: #859900; font-weight: bold;">for</span> stratj <span style="color: #859900; font-weight: bold;">in</span> stratmini:
        <span style="color: #268bd2;">temp</span> = <span style="color: #839496; font-weight: bold;">help</span>(temp,stratj)
    <span style="color: #859900; font-weight: bold;">return</span> np.dot(temp.flatten(),payoffi.flatten())


<span style="color: #586e75;">#</span><span style="color: #586e75;">This function takes a mixed strategy profile as argument.</span>
<span style="color: #586e75;">#</span><span style="color: #586e75;">The output is the Delta described above but it returns the Delta for all players as a flat(!)  numpy array.</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">Delta</span>(strat):
    <span style="color: #268bd2;">i</span> = 0
    <span style="color: #268bd2;">out</span> = []
    <span style="color: #859900; font-weight: bold;">while</span> i &lt; n:
        <span style="color: #268bd2;">stratmini</span> = strat[0:i] + strat[i+1:<span style="color: #839496; font-weight: bold;">len</span>(strat)]
        <span style="color: #268bd2;">uimax</span> = -1000.0<span style="color: #586e75;">#</span><span style="color: #586e75;">assumes that all payoffs are above -1000.0</span>
        <span style="color: #268bd2;">uilist</span> = []
        <span style="color: #859900; font-weight: bold;">for</span> action <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span> (no_a[i]):
            <span style="color: #268bd2;">uact</span> = EUi(stratmini,action,i)
            uilist.append(uact)
            <span style="color: #268bd2;">uimax</span> = <span style="color: #839496; font-weight: bold;">max</span>(uimax,uact)
        <span style="color: #268bd2;">deltai</span> = [item - uimax <span style="color: #859900; font-weight: bold;">for</span> item <span style="color: #859900; font-weight: bold;">in</span> uilist]
        out.append(deltai)
        <span style="color: #268bd2;">i</span>+=1
    <span style="color: #859900; font-weight: bold;">return</span> np.array([item <span style="color: #859900; font-weight: bold;">for</span> sublist <span style="color: #859900; font-weight: bold;">in</span> out <span style="color: #859900; font-weight: bold;">for</span> item <span style="color: #859900; font-weight: bold;">in</span> sublist])


<span style="color: #268bd2;">no_a_np</span> = np.array(no_a)
<span style="color: #268bd2;">total_no_a</span> = no_a_np.<span style="color: #839496; font-weight: bold;">sum</span>()

<span style="color: #268bd2;">lb</span> = [0.0]*total_no_a<span style="color: #586e75;">#</span><span style="color: #586e75;">lower bound to ensure that all probabilities are above 0</span>
<span style="color: #268bd2;">ub</span> = [1.0]*total_no_a<span style="color: #586e75;">#</span><span style="color: #586e75;">upper bound ensures that all probs are below 1</span>

<span style="color: #268bd2;">Aeq</span> = []<span style="color: #586e75;">#</span><span style="color: #586e75;">constraints that ensure that both the  mixed strategies fo each player sum to 1</span>
<span style="color: #268bd2;">beq</span> = [1.]*n<span style="color: #586e75;">#</span><span style="color: #586e75;">dito</span>
<span style="color: #268bd2;">x0</span> = []
<span style="color: #268bd2;">actagg</span> = [0]

<span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span>(n):
    <span style="color: #268bd2;">no_a_i</span> = no_a[i]
    Aeq.append([0.]*actagg[i] + [1.]*no_a_i + [0.]*(total_no_a-actagg[i]-no_a_i))
    <span style="color: #268bd2;">x0</span> = x0 + [1.0/no_a_i]*no_a_i
    actagg.append(actagg[i]+no_a_i)

<span style="color: #586e75;">#</span><span style="color: #586e75;">multiplies the vectors strat and Delta(strat); this product has to be 0 in equilibrium</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">product</span>(x):
    <span style="color: #268bd2;">strat</span> = []
    <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span>(n):
        strat.append(x[actagg[i]:actagg[i+1]])
    <span style="color: #859900; font-weight: bold;">return</span> np.dot(x,Delta(strat))

<span style="color: #268bd2;">p</span> = SNLE(product,x0,lb=lb,ub=ub,Aeq=Aeq,beq=beq)
<span style="color: #268bd2;">p.iprint</span> = -1
<span style="color: #268bd2;">r</span> = p.solve(<span style="color: #2aa198;">'nssolve'</span>)

<span style="color: #859900; font-weight: bold;">if</span> r.stopcase==1:
    <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">'there is an equilibrium in which '</span>
    <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #839496; font-weight: bold;">range</span>(n):
        <span style="color: #268bd2;">out</span> = [<span style="color: #839496; font-weight: bold;">round</span>(item,3) <span style="color: #859900; font-weight: bold;">for</span> item <span style="color: #859900; font-weight: bold;">in</span> r.xf[actagg[i]:actagg[i+1]]]
        <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">'player'</span>,i,<span style="color: #2aa198;">'uses the mixed strategy'</span>,out
<span style="color: #859900; font-weight: bold;">else</span>:
    <span style="color: #859900; font-weight: bold;">print</span> <span style="color: #2aa198;">'Error: solver cannot find an equilibrium'</span>

<span style="color: #859900; font-weight: bold;">print</span>(<span style="color: #2aa198;">"--- %s seconds ---"</span> % (time.time() - start_time))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
